{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "Qwen/Qwen2.5-VL-7B-Instruct",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": "(?!^(visual.merger))^(model)(?!.*\\b(lora_A|lora_B|base_layer|\\w*emb\\w*|wte|shared|lm_head|output|score|v_head|classifier)\\b).*",
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}